Tekla Open API Reference for Tekla Structures 2025
Operation Methods
The Operation type exposes the following members.
Methods
Name | Description
MergeMarks
 Merges given marks objects.
NOTE!! Merge requires the original mark content to be similar and of same type. Operation does not support associative notes, mark sets or template content.
SortObjectsByPresentationOrder
 Sorts objects relatively by presentation order from active drawing. Result is used to define relative drawing order of objects which are on top of each other. Last object from the list is drawn on top of all objects.
SplitMarks
 Splits given marks to original marks.
Top
See Also
Reference
Operation Class
Tekla.Structures.Drawing.Operations Namespace